fonecmid-diplom/src/InformationRegisters/ВКМ_УсловияОплатыСотрудников/ВКМ_УсловияОплатыСотрудников.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ВКМ_УсловияОплатыСотрудников</name>
  <informationRegisterPeriodicity>Month</informationRegisterPeriodicity>
  <resources>
    <name>Оклад</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ПроцентОтРабот</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
  <dimensions>
    <name>КатегорияСотрудника</name>
    <type>
      <types>CatalogRef.ВКМ_КатегорииСотрудников</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

fonecmid-diplom/src/InformationRegisters/ВКМ_УсловияОплатыСотрудников/Forms/ФормаЗаписи/Module.bsl
#Область ОбработчикиСобытийФормы

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ВидимостьРеквизитовОтВидаДоговора();	

КонецПроцедуры

&НаКлиенте
Процедура КатегорияСотрудникаПриИзменении(Элемент)
	
	ВидимостьРеквизитовОтВидаДоговора();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ВидимостьРеквизитовОтВидаДоговора()
	
	Если Запись.КатегорияСотрудника = ПредопределенноеЗначение("Справочник.ВКМ_КатегорииСотрудников.Специалист") Тогда
		
		Элементы.Оклад.Видимость = Ложь;
		Элементы.ПроцентОтРабот.Видимость = Истина;
		
	Иначе
		
		Элементы.Оклад.Видимость = Истина;
		Элементы.ПроцентОтРабот.Видимость = Ложь;
			
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
